#include <iostream>

//Проектирование программы в стиле ООП
//  Игра 21:
// составные части:
//      карты(номиналы, масти)
//      колода(набор карт)
//      игроки(имя, деньги, рука)
//      правила(Какой колодой играют,
//              сколько игроков,
//              как игра начинается,
//              условия победы,
//              правила ходов)
//      ведущий(для нашей программы данным управляющим
//              будет сама программа)
//      стол(места игроков,
//           ставки,
//           колода,
//           сброс,
//           слоты для карт
//           )
//      рука(набор карт у игрока)
//      
//

int main()
{
    std::cout << "Hello World!\n";
}